In [1]:
import pandas as pd
import numpy as np

Acquire customer_id, monthly_charges, tenure, and total_charges from telco_churn database for all customers with a 2 year contract.
Walk through the steps above using your new dataframe. You may handle the missing values however you feel is appropriate.
End with a python file wrangle.py that contains the function, wrangle_telco(), that will acquire the data and return a dataframe cleaned with no missing values.

In [3]:
from env import get_db

In [12]:
url = get_db('telco_churn')
sql = 'SELECT customer_id, monthly_charges, tenure, total_charges FROM customers JOIN contract_types USING (contract_type_id) WHERE contract_types.contract_type = "Two year";'

telco = pd.read_sql(sql, url)

In [13]:
telco.head()

  customer_id  monthly_charges  tenure total_charges
0  0013-SMEOE           109.70      71       7904.25
1  0014-BMAQU            84.65      63        5377.8
2  0016-QLJIS            90.45      65        5957.9
3  0017-DINOC            45.20      54       2460.55
4  0017-IUDMW           116.80      72       8456.75

In [15]:
telco.shape

(1695, 4)

In [16]:
telco.describe()

       monthly_charges       tenure
count      1695.000000  1695.000000
mean         60.770413    56.735103
std          34.678865    18.209363
min          18.400000     0.000000
25%          24.025000    48.000000
50%          64.350000    64.000000
75%          90.450000    71.000000
max         118.750000    72.000000

In [17]:
telco.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1695 non-null object
monthly_charges    1695 non-null float64
tenure             1695 non-null int64
total_charges      1695 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 53.1+ KB

In [18]:
print(telco.isnull().sum())

customer_id        0
monthly_charges    0
tenure             0
total_charges      0
dtype: int64

In [34]:
telco.total_charges.value_counts(sort=True, ascending=False)

5714.2     2
1161.75    2
343.45     2
1110.05    2
3533.6     2
          ..
1626.4     1
1278.8     1
5315.8     1
20.35      1
3632       1
Name: total_charges, Length: 1677, dtype: int64

In [33]:
telco.replace(r'^\s*$', np.nan, regex=True, inplace=True)

In [36]:
telco.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1695 non-null object
monthly_charges    1695 non-null float64
tenure             1695 non-null int64
total_charges      1685 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 53.1+ KB

In [40]:
telco = telco.dropna()

In [41]:
telco.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1685 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1685 non-null object
monthly_charges    1685 non-null float64
tenure             1685 non-null int64
total_charges      1685 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 65.8+ KB

In [42]:
telco.describe()

       monthly_charges      tenure
count      1685.000000  1685.00000
mean         60.872374    57.07181
std          34.712210    17.72913
min          18.400000     1.00000
25%          24.050000    48.00000
50%          64.450000    64.00000
75%          90.550000    71.00000
max         118.750000    72.00000